In [1]:
#Import libraries
import pandas as pd
import numpy as np

 It happens all the time: someone gives you data containing malformed strings,  Python, lists and missing data. How do you tidy it up so you can get on with the  analysis? 
Take this monstrosity as the DataFrame to use in the following puzzles: 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [2]:
# Create a data frame as name of the data fram is df
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
  'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [3]:
# print a df
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

In [4]:
# For to full fill above requirement
# create another data for original data then we have to copy original data
dfa= df.copy()

In [5]:
#fill nan value in FlightNumber like 10045,10055, 10065..... so on
dfa['FlightNumber']= dfa['FlightNumber'].interpolate()

In [6]:
#Print dfa
dfa

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
#makeing an another copy of original data is df1
df1= df.copy()

In [8]:
#print df1
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [9]:
# create two more column From and To cloumns form data df1 of column From_TO
df1[['From', 'TO']]= df.From_To.str.split('_', expand= True)

In [10]:
#print df1
df1

            From_To  FlightNumber  ...      From         TO
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [11]:
#create a copy of df1 as name of df2
df2= df1.copy()
df2

            From_To  FlightNumber  ...      From         TO
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

In [12]:
#Captitalize first letter of From and To and From_to columns
#capitalization of From_to
df2['From_To']= df2.From_To.str.capitalize()
#capitalization of From
df2['From']= df2.From.str.capitalize()
#capitalization of To
df2['TO']= df2.TO.str.capitalize()

In [13]:
#print df2
df2

            From_To  FlightNumber  ...      From         TO
0      London_paris       10045.0  ...    London      Paris
1      Madrid_milan           NaN  ...    Madrid      Milan
2  London_stockholm       10065.0  ...    London  Stockholm
3    Budapest_paris           NaN  ...  Budapest      Paris
4   Brussels_london       10085.0  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [14]:
#Create a copy of original data as df3
df3 = df.copy()

In [15]:
df3.drop('From_To' , axis= 1, inplace= True) # Drop a From_To cloumn from df3 data

In [16]:
# Print df3 we can see there we able to remove From_To column
df3

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1           NaN            []                 (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3           NaN          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [17]:
#Create a copy of original data as df4
df4= df.copy()
df4

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [18]:
# chnage a list into series of column RecentDelays of data df4
delays = df4['RecentDelays'].apply(pd.Series)
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [19]:
#change a column of delays' columns
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

In [20]:
#join a delays column in df4 data and remove RecentDelyas column form df4
df4 = df4.drop('RecentDelays', axis=1).join(delays)

In [21]:
#print df4
df4

            From_To  FlightNumber  ... delay_2  delay_3
0      LoNDon_paris       10045.0  ...    47.0      NaN
1      MAdrid_miLAN           NaN  ...     NaN      NaN
2  londON_StockhOlm       10065.0  ...    43.0     87.0
3    Budapest_PaRis           NaN  ...     NaN      NaN
4   Brussels_londOn       10085.0  ...    32.0      NaN

[5 rows x 6 columns]